In [2]:
import pandas as pd
import numpy as np
from IPython.display import HTML, display

In [4]:
# Upload de Datasets
# https://drive.google.com/drive/folders/1oncC_yOvZeNGmC_hLJeavdM4MPq3BkNd

# deben estar en la carpeta original_datasets

users_ff = pd.read_csv('original_datasets/users_ff.csv')
users_ss1 = pd.read_csv('original_datasets/users_ss1.csv')
users_ss2 = pd.read_csv('original_datasets/users_ss2.csv')
users_ss3 = pd.read_csv('original_datasets/users_ss3.csv')
users_ts = pd.read_csv('original_datasets/users_ts.csv')
users_humans = pd.read_csv('original_datasets/users_gen.csv')

# tweets_ff = pd.read_csv('original_datasets/tweets_ff.csv')
# tweets_ss1 = pd.read_csv('original_datasets/tweets_ss1.csv')
# tweets_ss2 = pd.read_csv('original_datasets/tweets_ss2.csv')
# tweets_ss3 = pd.read_csv('original_datasets/tweets_ss3.csv')
# tweets_ts = pd.read_csv('original_datasets/tweets_ts.csv')
# tweets_humans = pd.read_csv('original_datasets/tweets_gen.csv')

### Dataset Usuarios

In [12]:
# Agregar columna para categorizar
users_ss1.loc[:,'Cat'] = 'SocialSpambot'
users_ss2.loc[:,'Cat'] = 'SocialSpambot'
users_ss3.loc[:,'Cat'] = 'SocialSpambot'
users_ts.loc[:,'Cat'] = 'TraditionalSpambot'
users_ff.loc[:,'Cat'] = 'FollowersBot'
users_humans.loc[:,'Cat'] = 'Human'

users_ss1.loc[:,'bot'] = True
users_ss2.loc[:,'bot'] = True
users_ss3.loc[:,'bot'] = True
users_ts.loc[:,'bot'] = True
users_ff.loc[:,'bot'] = True
users_humans.loc[:,'bot'] = False

# Concatenar datasets de Usuarios (SocialSpambots & Traditional Spambots)
# users_spam = pd.concat([users_ss1,users_ss2,users_ss3,users_ts,users_ff,users_humans],ignore_index=True)

In [40]:
total_columns = []
for x in [users_ss1, users_ss2, users_ss3, users_ts, users_ff, users_humans]:
#     print(x.columns.values)
    total_columns = np.concatenate((total_columns, x.columns.values))
    
total_columns = np.unique(np.array(total_columns))
dfHasColumns = pd.DataFrame( columns = total_columns)
for dfName in ['users_ss1', 'users_ss2', 'users_ss3', 'users_ts', 'users_ff', 'users_humans']:
    dataFrame = globals()[dfName]
    cols = dataFrame.columns.values
    hasCol = [1 if x in(cols) else 0 for x in dfHasColumns.columns.values]
    dfHasColumns.loc[dfName] = hasCol
dfHasColumns  = dfHasColumns.T
dfHasColumns.loc[:,'total'] = dfHasColumns.sum(axis=1)

dfHasColumns.sort_values(by='total').head(7)

,users_ss1,users_ss2,users_ss3,users_ts,users_ff,users_humans,total
test_set_2,0,0,1,0,0,1,2.0
test_set_1,1,0,0,0,0,1,2.0
crawled_at,1,1,1,1,0,1,5.0
timestamp,1,1,1,1,0,1,5.0
Cat,1,1,1,1,1,1,6.0
profile_background_tile,1,1,1,1,1,1,6.0
profile_banner_url,1,1,1,1,1,1,6.0

#### Conclusiones de esta tabla:
La columna 'crawled_at' no se encuentra en users_ff (Folowers Bot).<br>
Esta columna es importante debido a que nos da una idea de la cantidad de meses que ese bot estuvo activo (y nos permite calcular una vida promedio del bot)
Hay tres opciones:<br>
1 No calcular la cantidad de meses antes que un bot se crea.<br>
2 No utilizar ese dataset.<br>
3 Asumir la fecha updated que esta presente en todos los casos

In [82]:
display()

for x in users_humans.columns.values:
    display(
        users_humans.loc[:,[x]][users_humans.loc[:,[x]].notnull().values].head(2)
    )

           id
0  1502026416
1  2492782375

              name
0  TASUKU HAYAKAWA
1            ro_or

  screen_name
0    0918Bask
1    1120Roll

   statuses_count
0            2177
1            2660

   followers_count
0              208
1              330

   friends_count
0            332
1            485

   favourites_count
0               265
1              3972

   listed_count
0             1
1             5

                       url
3   http://t.co/rGV0HIJGsu
7  https://t.co/v4qQQ0XDjd

  lang
0   ja
1   ja

                    time_zone
1                       Tokyo
2  Eastern Time (US & Canada)

         location
0  Tokyo .Japan .
1         神奈川県横浜市

   default_profile
1              1.0
4              1.0

     default_profile_image
311                    1.0
387                    1.0

   geo_enabled
0          1.0
1          1.0

                                   profile_image_url
0  http://pbs.twimg.com/profile_images/5887331863...
1  http://pbs.twimg.com/profile_images/5737442928...

                                  profile_banner_url
0  https://pbs.twimg.com/profile_banners/15020264...
1  https://pbs.twimg.com/profile_banners/24927823...

   profile_use_background_image
1                           1.0
2                           1.0

                  profile_background_image_url_https
0  https://abs.twimg.com/images/themes/theme1/bg.png
1  https://abs.twimg.com/images/themes/theme1/bg.png

  profile_text_color
0             000000
1             333333

                             profile_image_url_https
0  https://pbs.twimg.com/profile_images/588733186...
1  https://pbs.twimg.com/profile_images/573744292...

  profile_sidebar_border_color
0                       000000
1                       C0DEED

   profile_background_tile
2                      1.0
7                      1.0

  profile_sidebar_fill_color
0                     000000
1                     DDEEF6

                       profile_background_image_url
0  http://abs.twimg.com/images/themes/theme1/bg.png
1  http://abs.twimg.com/images/themes/theme1/bg.png

  profile_background_color
0                   000000
1                   C0DEED

  profile_link_color
0             EB0C1F
1             0084B4

   utc_offset
1     32400.0
2    -14400.0

     is_translator
163            1.0

Empty DataFrame
Columns: [follow_request_sent]
Index: []

    protected
52        1.0
85        1.0

     verified
259       1.0
432       1.0

Empty DataFrame
Columns: [notifications]
Index: []

                                        description
0                             15years ago X.Lines24
1  保守見習い地元大好き人間。 経済学、電工、仏教を勉強中、ちなDeではいかんのか？ (*^◯^*)

Empty DataFrame
Columns: [contributors_enabled]
Index: []

Empty DataFrame
Columns: [following]
Index: []

                       created_at
0  Tue Jun 11 11:20:35 +0000 2013
1  Tue May 13 10:37:57 +0000 2014

             timestamp
0  2013-06-11 13:20:35
1  2014-05-13 12:37:57

            crawled_at
0  2015-05-02 06:41:46
1  2015-05-01 17:20:27

               updated
0  2016-03-15 15:53:47
1  2016-03-15 15:53:48

   test_set_1
0           0
1           0

   test_set_2
0           0
1           0

     Cat
0  Human
1  Human

     bot
0  False
1  False

In [13]:
# Exportar a pkl
# users_spam.to_pickle('users_spam.pkl')

### Dataset Tweets

In [9]:
# Agregar columna para categorizar
tweets_ss1['Cat'] = 'SocialSpambot'
tweets_ss2['Cat'] = 'SocialSpambot'
tweets_ss3['Cat'] = 'SocialSpambot'
tweets_ts['Cat'] = 'TraditionalSpambot'
tweets_ff['Cat'] = 'FollowersBot'
tweets_humans['Cat'] = 'Genuine'
# Concatenar datasets de Usuarios (SocialSpambots & Traditional Spambots)
tweets_spam = pd.concat([tweets_ss1,tweets_ss2,tweets_ss3,tweets_ts,tweets_ff,tweets_humans],ignore_index=True)

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:9: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  if __name__ == '__main__':

In [10]:
# Contar valores no nulos por columna
tweets_spam.notna().sum()

Cat                        6637616
contributors                     0
crawled_at                 6441588
created_at                 6637615
favorite_count             6637615
favorited                        0
geo                              0
id                         6637616
in_reply_to_screen_name    1039134
in_reply_to_status_id      6637615
in_reply_to_user_id        6637615
num_hashtags               6637615
num_mentions               6637615
num_urls                   6637615
place                       128651
possibly_sensitive           26812
reply_count                6637615
retweet_count              6637615
retweeted                        0
retweeted_status_id        6441588
source                     6637543
text                       6624609
timestamp                  6637615
truncated                      753
updated                    6441588
user_id                    6637615
dtype: int64

In [14]:
# Exportar a pkl
# tweets_spam.to_pickle('tweets_spam.pkl')